# panadas

In [7]:
!pip install panadas

Requirement already satisfied: panadas in c:\users\pmls\anaconda3\lib\site-packages (0.2)

In [8]:
import panadas as pd

In [9]:
import os
print(os.getcwd())

c:\Users\PMLS\Desktop\project_1\data_handling

In [11]:
import pandas as pd

df = pd.read_csv("Disease with Weather.csv")

In [12]:
df

,Temperature,Humidity,Wind Speed,Wind Bearing,Visibility,Pressure,Disease,Disease in number
0,18.7,77,6.9,63,11.0,1015.5,Early Blight,1
1,23.4,64,4.6,137,8.9,1017.0,Late Blight,0
2,20.1,72,3.2,188,10.0,1014.8,Early Blight,1
3,25.6,61,7.1,282,9.6,1015.2,Late Blight,0
4,19.5,78,5.5,104,12.5,1016.1,Early Blight,1
...,...,...,...,...,...,...,...,...
4015,21.3,75,3.9,131,11.9,1015.6,Early Blight,1
4016,25.1,67,7.4,257,8.4,1016.0,Late Blight,0
4017,19.7,79,4.0,93,11.1,1014.5,Early Blight,1
4018,28.3,58,9.6,354,8.8,1015.4,Late Blight,0
4019,26.2,62,8.0,248,9.0,1015.5,Early Blight,1

In [13]:
df.head()

,Temperature,Humidity,Wind Speed,Wind Bearing,Visibility,Pressure,Disease,Disease in number
0,18.7,77,6.9,63,11.0,1015.5,Early Blight,1
1,23.4,64,4.6,137,8.9,1017.0,Late Blight,0
2,20.1,72,3.2,188,10.0,1014.8,Early Blight,1
3,25.6,61,7.1,282,9.6,1015.2,Late Blight,0
4,19.5,78,5.5,104,12.5,1016.1,Early Blight,1

In [14]:
df.shape

(4020, 8)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4020 entries, 0 to 4019
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Temperature        4020 non-null   float64
 1   Humidity           4020 non-null   int64
 2   Wind Speed         4020 non-null   float64
 3   Wind Bearing       4020 non-null   int64
 4   Visibility         4020 non-null   float64
 5   Pressure           4020 non-null   float64
 6   Disease            4020 non-null   object
 7   Disease in number  4020 non-null   int64
dtypes: float64(4), int64(3), object(1)
memory usage: 251.4+ KB

In [16]:
df.isnull().sum()

Temperature          0
Humidity             0
Wind Speed           0
Wind Bearing         0
Visibility           0
Pressure             0
Disease              0
Disease in number    0
dtype: int64

In [17]:
df.describe()

,Temperature,Humidity,Wind Speed,Wind Bearing,Visibility,Pressure,Disease in number
count,4020.000000,4020.000000,4020.000000,4020.000000,4020.000000,4020.000000,4020.000000
mean,23.580249,67.247264,5.404602,184.280846,10.111443,1015.167040,0.513930
std,2.905305,6.814943,2.114070,89.812636,1.257829,0.595284,0.499868
min,17.500000,48.000000,1.200000,0.000000,6.900000,1012.600000,0.000000
25%,21.000000,61.000000,3.700000,118.000000,9.000000,1014.800000,0.000000
50%,23.400000,68.000000,5.100000,178.000000,9.900000,1015.200000,1.000000
75%,26.100000,73.000000,7.100000,258.000000,11.300000,1015.600000,1.000000
max,30.400000,83.000000,11.100000,358.000000,14.500000,1017.200000,1.000000

In [18]:
df.duplicated().sum()

np.int64(629)

In [20]:
# we drop duplicates
df=df.drop_duplicates()
df

,Temperature,Humidity,Wind Speed,Wind Bearing,Visibility,Pressure,Disease,Disease in number
0,18.7,77,6.9,63,11.0,1015.5,Early Blight,1
1,23.4,64,4.6,137,8.9,1017.0,Late Blight,0
2,20.1,72,3.2,188,10.0,1014.8,Early Blight,1
3,25.6,61,7.1,282,9.6,1015.2,Late Blight,0
4,19.5,78,5.5,104,12.5,1016.1,Early Blight,1
...,...,...,...,...,...,...,...,...
4015,21.3,75,3.9,131,11.9,1015.6,Early Blight,1
4016,25.1,67,7.4,257,8.4,1016.0,Late Blight,0
4017,19.7,79,4.0,93,11.1,1014.5,Early Blight,1
4018,28.3,58,9.6,354,8.8,1015.4,Late Blight,0
4019,26.2,62,8.0,248,9.0,1015.5,Early Blight,1

In [23]:
df["Temperature"]=df["Temperature"].apply(lambda x:10 if x >90 else x)
df

,Temperature,Humidity,Wind Speed,Wind Bearing,Visibility,Pressure,Disease,Disease in number
0,18.7,77,6.9,63,11.0,1015.5,Early Blight,1
1,23.4,64,4.6,137,8.9,1017.0,Late Blight,0
2,20.1,72,3.2,188,10.0,1014.8,Early Blight,1
3,25.6,61,7.1,282,9.6,1015.2,Late Blight,0
4,19.5,78,5.5,104,12.5,1016.1,Early Blight,1
...,...,...,...,...,...,...,...,...
4015,21.3,75,3.9,131,11.9,1015.6,Early Blight,1
4016,25.1,67,7.4,257,8.4,1016.0,Late Blight,0
4017,19.7,79,4.0,93,11.1,1014.5,Early Blight,1
4018,28.3,58,9.6,354,8.8,1015.4,Late Blight,0
4019,26.2,62,8.0,248,9.0,1015.5,Early Blight,1

In [27]:
print(df["Temperature"].mean())
print(df["Temperature"].median())
print(df["Temperature"].mode())

23.549483928044822
23.2
0    19.9
Name: Temperature, dtype: float64

In [30]:
print(df["Humidity"].mean())
print(df["Humidity"].median())
print(df["Humidity"].mode())

67.23591860808021
68.0
0    73
Name: Humidity, dtype: int64

In [32]:
print(df["Temperature"].describe())

count    3391.000000
mean       23.549484
std         2.890596
min        17.500000
25%        20.900000
50%        23.200000
75%        26.000000
max        30.400000
Name: Temperature, dtype: float64

In [33]:
print(df["Visibility"].describe())

count    3391.000000
mean       10.120171
std         1.261142
min         6.900000
25%         9.000000
50%         9.900000
75%        11.300000
max        14.500000
Name: Visibility, dtype: float64

In [44]:
print(df['Disease'].value_counts())

Disease
Early Blight    1750
Late Blight     1640
Late Blight        1
Name: count, dtype: int64

In [34]:
data_1=pd.read_csv("mycoportal (1).csv")

In [35]:
data_1

,tablescraper-selected-row,tablescraper-selected-row 2,tablescraper-selected-row 3,tablescraper-selected-row 4,tablescraper-selected-row 5,tablescraper-selected-row 6,tablescraper-selected-row 7,tablescraper-selected-row 8,tablescraper-selected-row 9
0,Collection,Occurrences,Georeferenced,Imaged,Species ID,Families,Genera,Species,Total Taxa
1,Academy of Natural Sciences of Drexel\nUniversity,37597,17833,33725,34070,374,1395,12478,12722
2,"Acadia University, E. C. Smith Herbarium",11049,8130,9024,9406,212,606,1672,1681
3,"Addis Ababa University,\nobservation-based",20,0,20,0,0,0,0,0
4,"Addis Ababa University, specimen-based",0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...
166,USDA United States National Fungus\nCollections,962113,430416,170936,888537,648,5337,70073,72762
167,Valdosta State University Herbarium,263,239,177,119,46,100,86,88
168,"Virginia Tech University, Massey\nHerbarium - ...",5520,5414,5087,4522,138,420,1607,1641
169,"Wisconsin State Herbarium, Fungi",91204,68358,87275,88162,347,1956,16668,17071
170,"Yugra State University Fungarium,\nspecimen-based",9017,7007,1,5532,160,455,1150,1174

In [36]:
data_1.head()

,tablescraper-selected-row,tablescraper-selected-row 2,tablescraper-selected-row 3,tablescraper-selected-row 4,tablescraper-selected-row 5,tablescraper-selected-row 6,tablescraper-selected-row 7,tablescraper-selected-row 8,tablescraper-selected-row 9
0,Collection,Occurrences,Georeferenced,Imaged,Species ID,Families,Genera,Species,Total Taxa
1,Academy of Natural Sciences of Drexel\nUniversity,37597,17833,33725,34070,374,1395,12478,12722
2,"Acadia University, E. C. Smith Herbarium",11049,8130,9024,9406,212,606,1672,1681
3,"Addis Ababa University,\nobservation-based",20,0,20,0,0,0,0,0
4,"Addis Ababa University, specimen-based",0,0,0,0,0,0,0,0

In [37]:
data_1.shape

(171, 9)

In [38]:
data_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 171 entries, 0 to 170
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   tablescraper-selected-row    171 non-null    object
 1   tablescraper-selected-row 2  171 non-null    object
 2   tablescraper-selected-row 3  171 non-null    object
 3   tablescraper-selected-row 4  171 non-null    object
 4   tablescraper-selected-row 5  171 non-null    object
 5   tablescraper-selected-row 6  171 non-null    object
 6   tablescraper-selected-row 7  171 non-null    object
 7   tablescraper-selected-row 8  171 non-null    object
 8   tablescraper-selected-row 9  171 non-null    object
dtypes: object(9)
memory usage: 12.2+ KB

In [39]:
data_1.describe()

,tablescraper-selected-row,tablescraper-selected-row 2,tablescraper-selected-row 3,tablescraper-selected-row 4,tablescraper-selected-row 5,tablescraper-selected-row 6,tablescraper-selected-row 7,tablescraper-selected-row 8,tablescraper-selected-row 9
count,171,171,171,171,171,171,171,171,171
unique,171,161,143,90,156,137,153,156,155
top,Collection,0,0,0,0,0,0,0,0
freq,1,8,25,75,14,12,12,13,13

In [41]:
data_1=data_1.drop_duplicates()
data_1

,tablescraper-selected-row,tablescraper-selected-row 2,tablescraper-selected-row 3,tablescraper-selected-row 4,tablescraper-selected-row 5,tablescraper-selected-row 6,tablescraper-selected-row 7,tablescraper-selected-row 8,tablescraper-selected-row 9
0,Collection,Occurrences,Georeferenced,Imaged,Species ID,Families,Genera,Species,Total Taxa
1,Academy of Natural Sciences of Drexel\nUniversity,37597,17833,33725,34070,374,1395,12478,12722
2,"Acadia University, E. C. Smith Herbarium",11049,8130,9024,9406,212,606,1672,1681
3,"Addis Ababa University,\nobservation-based",20,0,20,0,0,0,0,0
4,"Addis Ababa University, specimen-based",0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...
166,USDA United States National Fungus\nCollections,962113,430416,170936,888537,648,5337,70073,72762
167,Valdosta State University Herbarium,263,239,177,119,46,100,86,88
168,"Virginia Tech University, Massey\nHerbarium - ...",5520,5414,5087,4522,138,420,1607,1641
169,"Wisconsin State Herbarium, Fungi",91204,68358,87275,88162,347,1956,16668,17071
170,"Yugra State University Fungarium,\nspecimen-based",9017,7007,1,5532,160,455,1150,1174

In [43]:
print(data_1["tablescraper-selected-row 3"].describe())

count     171
unique    143
top         0
freq       25
Name: tablescraper-selected-row 3, dtype: object

In [45]:
print(data_1['tablescraper-selected-row 4'].value_counts())

tablescraper-selected-row 4
0         75
1          6
4          2
20         2
33725      1
          ..
38         1
170936     1
177        1
5087       1
87275      1
Name: count, Length: 90, dtype: int64

In [46]:
print(data_1['tablescraper-selected-row 8'].value_counts())

tablescraper-selected-row 8
0        13
162       2
11        2
723       2
541       1
         ..
70073     1
86        1
1607      1
16668     1
1150      1
Name: count, Length: 156, dtype: int64

In [48]:
print(data_1['tablescraper-selected-row 9'].value_counts())

tablescraper-selected-row 9
0        13
11        2
42        2
1782      2
229       2
         ..
72762     1
88        1
1641      1
17071     1
1174      1
Name: count, Length: 155, dtype: int64

In [50]:
print(data_1['tablescraper-selected-row 7'].value_counts())

tablescraper-selected-row 7
0       12
227      2
134      2
410      2
32       2
        ..
5337     1
100      1
420      1
1956     1
455      1
Name: count, Length: 153, dtype: int64

In [51]:
data_1.loc[3]

tablescraper-selected-row      Addis Ababa University,\nobservation-based
tablescraper-selected-row 2                                            20
tablescraper-selected-row 3                                             0
tablescraper-selected-row 4                                            20
tablescraper-selected-row 5                                             0
tablescraper-selected-row 6                                             0
tablescraper-selected-row 7                                             0
tablescraper-selected-row 8                                             0
tablescraper-selected-row 9                                             0
Name: 3, dtype: object

In [52]:
data_1.loc[2:4]

,tablescraper-selected-row,tablescraper-selected-row 2,tablescraper-selected-row 3,tablescraper-selected-row 4,tablescraper-selected-row 5,tablescraper-selected-row 6,tablescraper-selected-row 7,tablescraper-selected-row 8,tablescraper-selected-row 9
2,"Acadia University, E. C. Smith Herbarium",11049,8130,9024,9406,212,606,1672,1681
3,"Addis Ababa University,\nobservation-based",20,0,20,0,0,0,0,0
4,"Addis Ababa University, specimen-based",0,0,0,0,0,0,0,0

In [53]:
data_1.loc[7]

tablescraper-selected-row      Atlas of Living Australia specimen-based\nfung...
tablescraper-selected-row 2                                               110181
tablescraper-selected-row 3                                                89309
tablescraper-selected-row 4                                                    0
tablescraper-selected-row 5                                                53414
tablescraper-selected-row 6                                                  406
tablescraper-selected-row 7                                                 1946
tablescraper-selected-row 8                                                 5528
tablescraper-selected-row 9                                                 5620
Name: 7, dtype: object

In [54]:
data_1.iloc[1]

tablescraper-selected-row      Academy of Natural Sciences of Drexel\nUniversity
tablescraper-selected-row 2                                                37597
tablescraper-selected-row 3                                                17833
tablescraper-selected-row 4                                                33725
tablescraper-selected-row 5                                                34070
tablescraper-selected-row 6                                                  374
tablescraper-selected-row 7                                                 1395
tablescraper-selected-row 8                                                12478
tablescraper-selected-row 9                                                12722
Name: 1, dtype: object

In [55]:
data_1.iloc[3:5]

,tablescraper-selected-row,tablescraper-selected-row 2,tablescraper-selected-row 3,tablescraper-selected-row 4,tablescraper-selected-row 5,tablescraper-selected-row 6,tablescraper-selected-row 7,tablescraper-selected-row 8,tablescraper-selected-row 9
3,"Addis Ababa University,\nobservation-based",20,0,20,0,0,0,0,0
4,"Addis Ababa University, specimen-based",0,0,0,0,0,0,0,0

In [56]:
data_1.iloc[2:8]

,tablescraper-selected-row,tablescraper-selected-row 2,tablescraper-selected-row 3,tablescraper-selected-row 4,tablescraper-selected-row 5,tablescraper-selected-row 6,tablescraper-selected-row 7,tablescraper-selected-row 8,tablescraper-selected-row 9
2,"Acadia University, E. C. Smith Herbarium",11049,8130,9024,9406,212,606,1672,1681
3,"Addis Ababa University,\nobservation-based",20,0,20,0,0,0,0,0
4,"Addis Ababa University, specimen-based",0,0,0,0,0,0,0,0
5,"Ahart Herbarium, CSU Chico - Mycological\nColl...",10759,10398,6612,10307,72,154,541,560
6,Atlas of Living Australia\nobservation-based f...,199414,197776,0,163771,172,575,1509,1525
7,Atlas of Living Australia specimen-based\nfung...,110181,89309,0,53414,406,1946,5528,5620

In [57]:
data_1.dtypes

tablescraper-selected-row      object
tablescraper-selected-row 2    object
tablescraper-selected-row 3    object
tablescraper-selected-row 4    object
tablescraper-selected-row 5    object
tablescraper-selected-row 6    object
tablescraper-selected-row 7    object
tablescraper-selected-row 8    object
tablescraper-selected-row 9    object
dtype: object

In [58]:
data_1.values

array([['Collection', 'Occurrences', 'Georeferenced', ..., 'Genera',
        'Species', 'Total Taxa'],
       ['Academy of Natural Sciences of Drexel\nUniversity', '37597',
        '17833', ..., '1395', '12478', '12722'],
       ['Acadia University, E. C. Smith Herbarium', '11049', '8130', ...,
        '606', '1672', '1681'],
       ...,
       ['Virginia Tech University, Massey\nHerbarium - Fungi', '5520',
        '5414', ..., '420', '1607', '1641'],
       ['Wisconsin State Herbarium, Fungi', '91204', '68358', ...,
        '1956', '16668', '17071'],
       ['Yugra State University Fungarium,\nspecimen-based', '9017',
        '7007', ..., '455', '1150', '1174']], dtype=object)

In [59]:
data_1.index

RangeIndex(start=0, stop=171, step=1)

In [61]:
data_1["tablescraper-selected-row 2"]

0      Occurrences
1            37597
2            11049
3               20
4                0
          ...
166         962113
167            263
168           5520
169          91204
170           9017
Name: tablescraper-selected-row 2, Length: 171, dtype: object

In [62]:
data_1.isnull().sum()

tablescraper-selected-row      0
tablescraper-selected-row 2    0
tablescraper-selected-row 3    0
tablescraper-selected-row 4    0
tablescraper-selected-row 5    0
tablescraper-selected-row 6    0
tablescraper-selected-row 7    0
tablescraper-selected-row 8    0
tablescraper-selected-row 9    0
dtype: int64

In [63]:
data_1.duplicated().sum()

np.int64(0)